#include <stdio.h>
#include <stdlib.h>
#include "pet.h"

//打印兔子外形 
void print_tuzi()
{
	printf("                            ,-*,-*\n                             (  (  (\n                                )  ) _..-.._\n                             __)/ ,*,*       *.\n                           ,*     **     ,--.  *.\n                         ,*   0        *'    *\n                        (Y            (           ;**.\n                         *--.____,               ,  ;\n                         ((_ ,----* ,---*      _,*_,*\n                             (((_,- (((______,-*");
 } 


//打印马外形 

void print_ma()
{
	printf("                                         ~~%%%%%%%%_,_,\n                                       ~~%%%%%%%%%-*/./\n                                     ~~%%%%%%%-*   / *.\n                                  ~~%%%%%%%%* .     ,--;\n                                ~~%%%%%%%%*   :       O\n                              ~~%%%%%%%%*    :          *.\n                           ~~%%%%%%%%*       *. -,        *\n                        ~~%%%%%%%%*          .**-.-        *.\n                    ~~%%%%%%%%%*           :     *-.     (,;\n                    ~~%%%%%%%%*             :         *.--.*\n                    ~~%%%%%%%*              ;");
 } 

//打印牛外形

void print_niu()
{
	printf("                               /~~~~/   /~~~~/\n                               /    /   /    /\n                                |  |_____|  |\n                              /~             ~/\n                     /~~~~~-_|  /~~/    /~~~/  |_-~~~~~\n                     / ==== /| |   O|  |O    | |/ ==== /\n                      ~-__-~ | |_---+--+----_| | ~-__-~\n                             |/~             ~/|\n                             /                 /\n                            (     O      O      )\n                              /              ./\n                               ~-__________-~|\n                               |   |/__/|    |\n                               |   |/~~/|    |\n                               | /~~~~~~~~~/ |\n                               | |         | |\n                               | |         | |");
 }  


void init_func(struct Pet *p){
	if(p->select_pet == 1){
		p->Max_age = 31;
	}else if(p->select_pet == 2){
		p->Max_age = 51;
	}else if(p->select_pet == 3){
		p->Max_age = 41;
	}
	p->age = 1;
	p->step = 20;
	p->time = 1;
	p->hungery = 0;
	p->thirsty = 0;
	p->healthy = 2;
	p->mood = 0;

}