//1
#include <stdio.h>
int main()
{
	char a = -1;
	//100000000000000000000000000000001
	//111111111111111111111111111111110
	//111111111111111111111111111111111——补码
	//11111111
	//111111111111111111111111111111111——整型提升
	//-1
	signed char b = -1;
	//11111111
	//-1
	unsigned char c = -1;
	//111111111
	//000000000000000000000000011111111
	//255
	printf("a = %d,b = %d,c = %d",a,b,c);
	return 0;
}
//-1  -1  255

//2
#include <stdio.h>
int main()
{
	char a = -128;
	//10000000000000000000000010000000
	//11111111111111111111111101111111
	//11111111111111111111111110000000——补码
	//10000000——要打印先提升
	//11111111111111111111111110000000——整型提升补码
	//打印十进制的无符号数
	printf("%u",a);
	//%d—打印十进制的有符号数
	//%u—打印十进制的无符号数
	return 0;
}
//4294967168

//3
#include <stdio.h>
int main()
{
	char a = 128;//-128
	printf("%u",a);
	return 0;
}
//4294967168

//4
#include <stdio.h>
int main()
{
	int i = -20;
	//10000000 00000000 00000000 00010100——原码
	//11111111 11111111 11111111 11101011——反码
	//11111111 11111111 11111111 11101100——补码
	unsigned int j = 10;
	//00000000 00000000 00000000 00001010——补码
	printf("%d",i + j);
	//11111111 11111111 11111111 11110110——结果
	//11111111 11111111 11111111 11110101
	//10000000 00000000 00000000 00001010
	//-10
	return 0;
}

//5
#include <stdio.h>
int main()
{
	unsigned int i;//i永远为正
	for (i = 9; i >= 0; i--)
	{
		printf("%u\n",i);
	}
	return 0;
}
//9 8 7 6 5 4 3 2 1 死循环

//6
#include <stdio.h>
#include <string.h>
int main()
{
	char a[1000];
	int i;
	for (i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	printf("%d",strlen(a));
	return 0;
}
//255
//-1 -2 ……-128 127 ……3 2 1 '\0'
//       128  |  127

//7
#include <stdio.h>
unsigned char i = 0;//0-255
int main()
{
	for (i = 0; i <= 255; i++)//255+1=0
	{
		printf("hello world\n");
	}
	return 0;
}
